/**
 * Правописен конвертор
 * Променя правописа на думите, използвайки правилата на Дриновско-Иванчевския правопис
 * @author Петър Неделев e-mail: nedelevbg@abv.bg
 */


import java.util.ArrayList;
import java.util.Arrays;
import java.util.Locale;

import javafx.scene.control.ProgressBar;

public class Converter {

   private final String[] cons = {"б", "в", "г", "д", "ж", "з", "к", "л", "м", "н", "п", "р", "с", "т", "ф", "х", "ц", "ч", "ш", "щ"};
   private final String[] softEndingWords = {"печал","погибел","абсолютност","абсурдност","автентичност","авторитетност","агресивност","адекватност","активност","актуалност","акуратност","алергичност","алкалност","алчност","амбивалентност","аморалност","аморфност","ангажираност","анонимност","анормалност","античност","апатичност","аполитичност","аргументираност","арогантност","ароматичност","артистичност","архаичност","асиметричност","асимилираност","аскетичност","атакуемост","атипичност","бавност","баналност","баснословност","бдителност","бедност","безапелационност","безболезненост","безбрежност","безвкусност","безводност","безвредност","безвъзвратност","безграмотност","безграничност","безгрешност","безгрижност","бездарност","бездейност","бездушност","безжизненост","беззаветност","беззащитност","безидейност","безизвестност","безизразност","безизходност","безконечност","безконтролност","безкористност","безкрайност","безкритичност","безличност","безлюдност","безмерност","безмилостност","безнадеждност","безнаказаност","безнравственост","безобидност","безоблачност","безогледност","безопасност","безоснователност","безосновност","безотговорност","безотчетност","безочливост","безплановост","безплодност","безплътност","безпогрешност","безполезност","безпомощност","безпорочност","безпочвеност","безпощадност","безпределност","безпредметност","безпретенциозност","безпринципност","безпристрастност","безпътност","безрадостност","безразборност","безразсъдност","безрезервност","безрезултатност","безропотност","безсистемност","безскрупулност","безсловесност","безсмисленост","безсмъртност","безспорност","безстопанственост","безстрастност","безсъвестност","безсъдържателност","безсъзнателност","безсърдечност","безтегловност","безтелесност","безукоризненост","безукорност","безупречност","безусловност","безуспешност","безутешност","безучастност","безформеност","безхарактерност","безцветност","безцелност","безценност","безцеремонност","безчисленост","безчовечност","безчувственост","безшумност","бележитост","биполярност","битност","благовидност","благовъзпитаност","благодарност","благодат","благодетелност","благозвучност","благонадеждност","благопристойност","благоприятност","благоразположеност","благосклонност","благост","благотворителност","благоуханност","благочинност","бледност","бледост","близост","блудкавост","бляскавост","богобоязливост","богобоязън","бодливост","бодрост","боеспособност","божественост","бойкост","болезненост","болест","болнавост","бомбастичност","боязливост","боязън","брашненост","бременност","бруталност","будност","буйност","бурност","бъбривост","бъдещност","важност","валентност","валидност","варовитост","вглъбеност","вдлъбнатост","вдълбоченост","вдървеност","вдъхновеност","ведомост","ведрост","вежливост","вездесъщност","величавост","величественост","верижност","верност","веротърпимост","вероятност","вертикалност","веселост","вест","ветровитост","вечер","вечност","вещ","вещественост","взаимност","взаимозависимост","взаимопомощ","взискателност","видимост","виновност","вирнатост","виртуозност","вирулентност","вискозност","висококачественост","високонравственост","високопарност","вихреност","вкаменелост","вкамененост","вкорененост","вкочаненост","влажност","власт","влюбеност","влюбчивост","вманиаченост","вменяемост","вместимост","внезапност","внимателност","внушаемост","внушителност","водоизместимост","водоустойчивост","войнственост","волевост","волност","впечатлителност","враждебност","вредност","временност","вроденост","всеизвестност","всеобхватност","всеобщност","всеотдайност","всестранност","втвърденост","второстепенност","втренченост","вулгарност","вцепененост","възбуденост","възбудимост","възбудителност","възвишеност","възвращаемост","въздържаност","възможност","възмъжалост","възпламенимост","възпламеняемост","възприемчивост","възпроизводимост","възраст","възстановимост","възторженост","вълнодайност","вълнообразност","външност","въображаемост","въоръженост","вътрешност","вялост","вярност","вятърничавост","гад","гадност","гадост","газ","газообразност","галантност","гальовност","гениалност","героичност","гибел","гиздавост","гладкост","гламавост","гласност","гласовитост","глеч","глуповатост","глупост","гневност","гнилост","гнусливост","говорливост","годност","голословност","горделивост","гордост","горимост","гостоприемност","готовност","грабливост","гражданственост","грамотност","грандиозност","гранивост","грапавост","грациозност","грес","греховност","грижливост","грижовност","грозноватост","грохналост","грубоватост","грубост","гръмкост","гузност","гъвкавост","гърбавост","давност","даденост","далекобойност","далновидност","даровитост","движимост","двойност","двойственост","двоякост","двукратност","двуполовост","двусмисленост","девственост","дегенерираност","дееспособност","дезорганизираност","дейност","действеност","действителност","декоративност","деликатност","делимост","делничност","деловитост","демократичност","демоничност","детайлираност","детайлност","детерминираност","дефективност","дефектност","деятелност","диаметралност","дивост","динамичност","дискретност","диспропорционалност","дисциплинираност","длан","длъжност","доблест","доближеност","доброволност","добродетел","добродетелност","доброжелателност","доброкачественост","добросъвестност","добросърдечност","довереност","доверчивост","догадливост","догматичност","договореност","доизкусуреност","доизработеност","доизясненост","доказаност","доказуемост","докачливост","долнокачественост","долнопробност","доловимост","домашност","доминантност","допустимост","досадливост","досегаемост","досетливост","достатъчност","достижимост","достоверност","достъпност","доходност","драгост","драгоценност","дразливост","дразнимост","драматичност","дребнавост","древност","дрезгавост","дремливост","дрипавост","дроб","дружелюбност","дружност","дръгливост","дръпнатост","духовитост","духовност","душевност","дъждовитост","дъждовност","дълбокомисленост","дълговечност","дълговременност","дълготрайност","дължимост","държавност","държеливост","дързост","дяволитост","евентуалност","егоистичност","егоцентричност","единичност","единност","единственост","еднаквост","едновременност","еднозначност","еднообразност","еднородност","едностранчивост","едносъставност","еднотонност","еквивалентност","екзактност","екзалтираност","екзотичност","експанзивност","експедитивност","експлозивност","експресивност","екстензивност","екстериториалност","екстравагантност","екстремност","ексцентричност","еластичност","елегантност","електропроводимост","електропроводност","електропромишленост","елементарност","елиптичност","емкост","емоционалност","емфатичност","енергичност","енергоемкост","енигматичност","ерес","есен","естественост","естетичност","ефективност","ефикасност","ефимерност","ефирност","ехидност","жадност","жал","жалост","жаркост","желателност","женственост","жертвеност","жертвоготовност","жестокост","жестокосърдечност","живопис","живописност","живост","животворност","животопис","жизненост","жизнерадост","жизнеспособност","жилавост","жлъчност","заангажираност","забавност","забележимост","забележителност","заболеваемост","забърканост","завеяност","зависимост","завист","завистливост","завършеност","загадъчност","загнилост","загриженост","загрубялост","задоволеност","задоволителност","задоменост","задружност","задушевност","задушливост","задълбоченост","задълженост","задължителност","заетост","заинатеност","заинтересованост","закаленост","закачливост","законнороденост","законност","закономерност","законосъобразност","закоравялост","закостенялост","закрепналост","закрепостеност","закръгленост","заледеност","залисаност","заличимост","замаяност","заменимост","заменяемост","замесеност","замечтаност","замисленост","замогнатост","заможност","замръзналост","замрялост","замъгленост","замърсеност","занемареност","занесеност","занимателност","заобленост","заостреност","западналост","запазеност","запаленост","запалимост","запалителност","заплеснатост","заплетеност","заповед","запознатост","запуснатост","запустялост","запълненост","заразимост","заразителност","заразност","заран","засегнатост","заседналост","заслепеност","заспалост","застарялост","застоялост","затвореност","затвърденост","затегнатост","затлъстялост","затревеност","затрудненост","затъженост","затъмненост","затънтеност","затъпялост","захар","захарност","захласнатост","защитеност","защитимост","заядливост","звукопроводимост","звукопроводност","звучност","звънливост","здравословност","зиморличавост","злобност","зловредност","злокачественост","злонамереност","злопаметност","злост","злъч","злъчност","знаменитост","знатност","значимост","значителност","зоркост","зрелост","зрялост","зърнистост","игривост","идейност","идентичност","иевъзможност","избираемост","избистреност","изборност","изброимост","избухливост","избуялост","известност","извеяност","извинителност","извитост","извратеност","изгладимост","изгодност","издаденост","издигнатост","издръжливост","издутост","издържаност","издържливост","изисканост","изискуемост","изказаност","изключителност","изкривеност","изкусност","изкуственост","изкуфялост","излечимост","изличимост","излиятелност","изложеност","измамливост","изменчивост","изменяемост","измеримост","изнеженост","изнемощялост","износваемост","износеност","изнуреност","изобретателност","изолираност","изопаченост","изопнатост","изоставеност","изостаналост","изостреност","изпаряемост","изповед","използваемост","изправеност","изправност","изпъкналост","изпълнимост","изпълнителност","изразителност","изразност","изроденост","изрядност","изсъхналост","изтощеност","изтръпналост","изтъкнатост","изтънченост","изтърканост","изхабеност","изцъкленост","изчерпаност","изчерпателност","изясненост","изящност","икономичност","иконопис","илюзорност","иманентност","имбецилност","именитост","имотност","импозантност","импотентност","импулсивност","инвалидност","индивидуалност","индивудалност","индиферентност","индуктивност","инертност","инициативност","интегралност","интезнивност","интелектуалност","интелигентност","интензивност","интернационалност","интимност","инфантилност","инфекциозност","информираност","ирационалност","иреалност","ирелевантност","искреност","истинност","историчност","кадърност","каленост","калоричност","кампанийност","капилярност","капризност","картинност","категоричност","каузалност","качественост","кашкавост","квалифицираност","кекавост","киберспособност","киселинност","киселиноустойчивост","класовост","класосъзнателност","книжност","книжовност","ковкост","кокетливост","кокетност","кокошничавост","колебливост","колегиалност","колективност","колоритност","комедийност","комичност","компактност","компетентност","комплектност","комплицираност","конвенционалност","конвергентност","конвертируемост","конгениалност","конкретност","конкурентоспособност","консеквентност","консервативност","конспиративност","константност","контразаповед","конфиденциалност","концентричност","координираност","копан","коравост","коравосърдечност","коректност","корист","корпулентност","косвеност","косматост","кост","костеливост","котерийност","кохерентност","крайност","красноречивост","кратковременност","краткост","краткотрайност","кратност","кредитоспособност","крепкост","крепост","кресливост","крехкост","критичност","кротост","кръвожадност","културност","къдравост","кълняемост","лабилност","лаконичност","ласкавост","латентност","легалност","легендарност","легитимност","лековерност","лековитост","лекомисленост","лекост","ленивост","леност","лепкавост","лепливост","летливост","лечебност","лечимост","либералност","лигавост","ликвидност","линейност","лиричност","литературност","личност","ловкост","логичност","лошокачественост","лоялност","лудост","лукавост","луминесцентност","лъжливост","лъжовност","лъскавост","лъчезарност","любвеобилност","любезност","любов","любознателност","магнетичност","мазност","малобройност","маловажност","малограмотност","малокултурност","малостойност","малоценност","малочисленост","маневреност","маниерност","масивност","масленост","маслодайност","масовост","маст","материалност","матовост","мащабируемост","мед","мекост","мекушавост","мелодичност","мелодраматичност","мерзост","меркантилност","меродавност","местност","металност","метафоричност","методиченост","методичност","мечтателност","мигновеност","мизерност","миловидност","милост","милостивост","мимолетност","миролюбивост","мисловност","мистериозност","мистичност","младост","млекодайност","млечност","мнителност","многобройност","многозвучност","многозначност","многократност","многоликост","многолюдност","многообразност","многоречивост","многостранност","многофункционалност","многочисленост","множественост","модалност","моменталност","монолитност","монотонност","монументалност","моралност","мореходност","мотивираност","мощ","мощност","мразовитост","мразоустойчивост","мрачност","мудност","музикалност","мургавост","мъгливост","мъглявост","мъдрост","мъжделивост","мъжественост","мълчаливост","мързеливост","мършавост","мъст","мътност","мъхавост","мъхнатост","мъчноподвижност","мъчнотопимост","набитост","наблюдателност","набожност","набръчканост","навлажненост","навременност","навъсеност","нагледност","наглост","нагодимост","нагодливост","нагънатост","нагърченост","надареност","надеждност","надменност","надробеност","надупченост","надутост","наеженост","нажаленост","нажеженост","назадничавост","назалност","назидателност","назъбеност","наивност","наказуемост","наклоненост","наклонност","накърнимост","наличност","наложителност","налудничавост","намагнитеност","намасленост","намръщеност","намусеност","наостреност","нападателност","напаст","напевност","напереност","напетост","наплашеност","направляемост","напрегнатост","напредничавост","напуснатост","нареденост","народност","населеност","наситеност","наследственост","наследяемост","насмешливост","насоченост","настойчивост","настоятелност","настъпателност","настървеност","натегнатост","натовареност","натрапничавост","натрапчивост","натренираност","натруфеност","натуралност","натъженост","научност","нахаканост","нахалност","нахалост","находчивост","националност","нацупеност","начетеност","начумереност","начупеност","нащърбеност","неабсолютност","неадекватност","неактивност","неакуратност","неангажираност","неблаговидност","неблаговъзпитаност","неблагодарност","неблагозвучност","неблагонадеждност","неблагонамереност","неблагоприятност","неблагосклонност","небрежност","невалидност","невежественост","невежливост","неверност","невероятност","невеселост","невещественост","невзискателност","невзрачност","невидимост","невинност","невиновност","невменяемост","невнимателност","невредимост","невъзвратимост","невъзвращаемост","невъздържаност","невъзможност","невъзмутимост","невъзпитаност","невъзпламеняемост","невъзприемчивост","невъобразимост","невярност","негативност","негладкост","негодност","негостоприемност","неготовност","неграмотност","недалновидност","недвижимост","недвусмисленост","недееспособност","недействителност","неделикатност","неделимост","недеятелност","недискретност","недисциплинираност","недоброжелателност","недоброкачественост","недобросъвестност","недоверчивост","недовършеност","недодяланост","недозрялост","недоказаност","недоловимост","недопустимост","недоразвитост","недосегаемост","недосетливост","недостатъчност","недостижимост","недостоверност","недостъпност","недружелюбност","недъгавост","недълготрайност","нееднаквост","нееднозначност","нееднородност","нееластичност","неестественост","неефективност","неефикасност","нежелателност","нежност","незаангажираност","незабавност","незабележимост","независимост","незавършеност","незагриженост","незадоволеност","незадоволителност","незадоменост","незадълбоченост","незадължителност","незаетост","незаинтересованост","незаконнороденост","незаконност","незакономерност","незаконосъобразност","незаличимост","незаразимост","незащитеност","незащитимост","нездравословност","незлобивост","незначителност","незрелост","незрялост","неизбежност","неизбираемост","неизброимост","неизвестност","неизгодност","неиздръжливост","неиздържаност","неизисканост","неизказаност","неизлечимост","неизличимост","неизменност","неизменяемост","неизмеримост","неизползваемост","неизправимост","неизправност","неизпълнимост","неизпълнителност","неизразимост","неизразителност","неизтощимост","неизтриваемост","неизцеримост","неизчерпаемост","неизчислимост","неизясненост","неизяснимост","неимоверност","неискреност","неистинност","некадърност","некачественост","неквалифицираност","некомпактност","некомпетентност","неконвертируемост","некоординираност","некоректност","некредитоспособност","некултурност","нелегалност","нелепост","нелетливост","неловкост","нелогичност","нелоялност","нелюбезност","нелюбознателност","немарливост","нематериалност","немедленост","немилост","неминуемост","немислимост","неморалност","немощ","немощност","ненавист","ненавременност","ненадеждност","ненадейност","ненаказуемост","ненакърнимост","ненареденост","ненарушимост","ненаситност","ненаучност","неначетеност","ненормалност","необвързаност","необиграност","необикновеност","необичайност","необменяемост","необмисленост","необозримост","необоримост","необоснованост","необработеност","необразованост","необратимост","необузданост","необхватност","необходимост","необщителност","необяснимост","необятност","неограниченост","неогъваемост","неодушевеност","неокончателност","неокосменост","неопетненост","неопитност","неопределеност","неопределимост","неопровержимост","неорганизираност","неориентираност","неосведоменост","неосезаемост","неоснователност","неоспоримост","неосторожност","неосъществимост","неотвратимост","неотделимост","неотемност","неотзивчивост","неотклонност","неотклоняемост","неоткровеност","неотложност","неотменимост","неотнимаемост","неотразимост","неотстъпност","неотстъпчивост","неотчуждаемост","неофициалност","неоформеност","неоценимост","неочакваност","непериодичност","неплатежоспособност","неплодородност","неплодотворност","непобедимост","неповратливост","непогрешимост","неподатливост","неподвижност","неподготвеност","неподкупност","неподправеност","неподражаемост","неподсъдност","неподходност","непознаваемост","непознатост","непоквареност","непокваримост","непоклатимост","непоколебимост","непокорност","непокътнатост","неполитичност","непоносимост","непонятност","непоправимост","непопулярност","непорочност","непорядъчност","непоследователност","непослушност","непосредственост","непостижимост","непостоянност","непотребност","непохватност","непочтеност","непочтителност","неправдоподобност","неправилност","неправомерност","неправоспособност","непрактичност","непревземаемост","непревзетост","непревратимост","непрегледност","непредаваемост","непредвиденост","непредвидимост","непредвидливост","непреднамереност","непредотвратимост","непредпазливост","непредприемчивост","непредубеденост","непреклонност","непрекъснатост","непреодолимост","непрепоръчителност","непресметливост","непрестанност","непрестореност","непретенциозност","непреходност","неприветливост","неприветност","непривлекателност","непригодност","непридирчивост","неприемливост","непризнателност","неприкосновеност","неприкритост","неприличност","неприложимост","непримиримост","непринадлежност","непринуденост","неприспособеност","неприспособимост","непристойност","непристъпност","неприязненост","неприятност","непроводимост","непрогледност","непродуктивност","непродължителност","непрозорливост","непрозрачност","непроизводителност","непроменимост","непроменливост","непроменчивост","непроменяемост","непромокаемост","непроницаемост","непроницателност","непропорционалност","непросветеност","непростимост","непростителност","непроходимост","непълноценност","неработоспособност","неравномерност","неравност","нерадост","нерадушност","неразбираемост","неразбраност","неразвитост","неразгадаемост","неразговорливост","неразделимост","неразделност","неразкаяност","неразличимост","неразлъчност","неразменяемост","неразположеност","неразпоредителност","неразрешимост","неразривност","неразсъдливост","неразтворимост","неразтрогваемост","неразумност","нерационалност","нервност","нервозност","нереалност","нередност","нередовност","нерелигиозност","нерентабилност","нерешителност","неритмичност","нерушимост","несамостоятелност","несамоувереност","несвиваемост","несвоевременност","несвързаност","несвършеност","несвяст","несговорливост","несговорност","несговорчивост","несгодност","несгъваемост","несгъстимост","несдържаност","несериозност","несигурност","несиметричност","несимпатичност","несистематизираност","несистемност","несклонимост","несклонност","несклоняемост","нескончаемост","нескопосност","нескромност","несложност","несломимост","несмелост","несменяемост","несметност","несмилаемост","несмутимост","несолидност","несполучливост","неспособност","несправедливост","неспретнатост","несравнимост","несродност","несръчност","нестабилност","нестройност","несхватливост","несходност","несъбуденост","несъвместимост","несъгласуваност","несъгласуемост","несъзвучност","несъзнателност","несъизмеримост","несъкратимост","несъкрушимост","несъмненост","несъобразителност","несъобразност","несъответственост","несъпричастност","несъразмерност","несъсредоточеност","несъстоятелност","несъчлененост","несъщественост","нетактичност","нетленност","нетолерантност","нетопимост","неточност","нетрайност","нетрезвеност","нетрудоспособност","нетърпеливост","нетърпимост","неубеденост","неубедимост","неубедителност","неувереност","неугледност","неугодност","неудачност","неудовлетвореност","неудовлетворителност","неудолетвореност","неудържимост","неузнаваемост","неукрепналост","неукротимост","неулегналост","неуловимост","неумелост","неумереност","неуместност","неумишленост","неумолимост","неуморимост","неуморност","неупотребяемост","неуравновесеност","неуреденост","неуредност","неуслужливост","неуспеваемост","неустановеност","неустойчивост","неустрашимост","неутешимост","неутоленост","неутолимост","неуточненост","неутралност","неучтивост","неуютност","неуязвимост","нехайност","нехерметичност","нехигиеничност","нехигроскопичност","нецелесъобразност","нецеломъдреност","нецензурност","нечестивост","нечестност","нечетливост","нечистоплътност","нечленоразделност","нечовечност","нечувствителност","нечупливост","неясност","низост","нищожност","новост","нормалност","носливост","нощ","нравственост","обаятелност","обвързаност","обединеност","обезвереност","обеззаразеност","обезнадежденост","обезпеченост","обезправеност","обезсиленост","обезсърченост","обезумялост","обезформеност","обезщетеност","обективност","обемност","обиграност","обидчивост","обилност","обител","обич","обичайност","обичливост","облагаемост","област","облачност","обложеност","облост","обменяемост","обмисленост","обобщеност","обозримост","обоснованост","обособеност","образност","образованост","обращаемост","обредност","обреченост","обстойност","обтегнатост","обусловеност","обхватност","обширност","общественост","общителност","общност","общодостъпност","общоизвестност","общоприетост","общоприложимост","обърканост","обязаност","огнеупорност","огорченост","ограниченост","огромност","одухотвореност","одушевеност","ожесточеност","оживеност","озадаченост","озвереност","озлобеност","окаяност","околност","окончателност","окосменост","окръжност","омайност","омърлушеност","онемялост","опакост","опасност","оперативност","опитност","определеност","определимост","опростеност","опърничавост","опърпаност","организираност","оригиналност","ориенталност","ориентираност","орис","ортодоксалност","оръфаност","ос","осведоменост","осветеност","осезаемост","осезателност","осигуреност","оскъдност","оскърбителност","ослепителност","основаност","основателност","основност","особеност","остарялост","осторожност","осъдителност","осъществимост","ответственост","отвлеченост","отвореност","отговорност","отдаденост","отдалеченост","отделеност","отделимост","отегчителност","отживялост","отзивчивост","откаченост","откритост","откровеност","откъслечност","откъснатост","отличителност","отмалялост","отмереност","отмъстителност","относителност","отпадналост","отпуснатост","отривистост","отровност","отсеченост","отслабналост","отстраненост","отстранимост","отстъпчивост","отчаяност","отчетливост","отчетност","отчуждаемост","отчужденост","официалност","оформеност","охолност","охотност","охраненост","оцветеност","очарованост","очарователност","очебийност","очевидност","пагубност","пакост","палавост","памет","паметливост","паплач","парадност","парадоксалност","парливост","партийност","пасивност","паст","патетичност","патогенност","патологичност","патриархалност","педантичност","пепел","перверзност","периодичност","перманентност","перпендикулярност","персоналност","перфектност","перфидност","пестеливост","пестовност","пещ","пивкост","пикантност","пипкавост","писменост","питателност","пищност","плавателност","плавност","пламенност","плановост","планомерност","пластичност","платежоспособност","плахост","плашливост","пленителност","плешивост","плещ","плиткост","плодовитост","плодородност","плодотворност","плоскост","площ","плъзгавост","плътност","побърканост","повелителност","поверителност","повест","повехналост","повинност","повратливост","повратност","повсеместност","повтаряемост","повърхност","повърхностност","погрешимост","погрешност","погълнатост","податливост","подвижност","подвластност","подготвеност","подигравателност","подкупност","подлост","подозрителност","подотчетност","подпухналост","подраст","подреденост","подробност","подсъдимост","подсъдност","подтиснатост","подутост","подчертаност","подчиненост","поетичност","пожертвувателност","позитивност","познаваемост","познатост","показваемост","показност","покаяност","поквареност","покорност","полегатост","полезност","политичност","половинчатост","половост","положителност","полунощ","полуокръжност","полуос","полярност","помощ","помпозност","поносимост","понятност","популярност","поредност","порочност","портативност","порутеност","порядъчност","посещаемост","последователност","последовност","пословичност","послушност","посредственост","постепенност","постижимост","постоянност","посърналост","потайност","потентност","потенциалност","потиснатост","поточност","потребност","поучителност","похабеност","похватност","похот","похотливост","почест","почет","почит","почтеност","почтителност","пошлост","пощръклялост","правдивост","правдоподобност","праведност","правилност","правоверност","праволинейност","правомерност","правоспособност","празничност","практичност","превзетост","превратност","прегледност","прегракналост","прегънатост","прегърбеност","преданост","предвзетост","предвидимост","предвидливост","пределност","предизвикателност","предикативност","предметност","предназначеност","преднамереност","предопределеност","предпазливост","предприемчивост","предразположеност","представителност","предубеденост","предумишленост","предусетливост","предутрин","преждевременност","презаангажираност","презрителност","преизбираемост","прекаленост","прекомерност","прелест","премалялост","премъдрост","пренаселеност","пренаситеност","пренебрежителност","препоръчителност","пресиленост","пресипналост","преситеност","пресметливост","престарялост","престореност","престъпност","пресъхналост","претенциозност","претовареност","претрупаност","претъпканост","префиненост","префърцуненост","прехвърляемост","прехласнатост","преходност","прецизност","пречистеност","приближеност","приблизителност","прибързаност","приветливост","привидност","привлекателност","привързаност","пригодимост","пригодливост","пригодност","приготвеност","придаденост","придан","придирчивост","приемливост","приемственост","признателност","призрачност","приказливост","приказност","прикритост","прилежност","прилепчивост","приличност","приложимост","приложност","примамливост","примиреност","примиримост","примирителност","примитивност","принадлежност","принуденост","принципиалност","принципност","приобщеност","приповдигнатост","припряност","приспособимост","пристойност","пристрастеност","пристрастност","притегателност","притесненост","прихватливост","причинност","причудливост","приятност","пробивност","провинциалност","проводимост","прогледност","прогнилост","програмираност","програмност","прогресивност","продажност","продуктивност","продълговатост","продължителност","прозаичност","прозорливост","прозрачност","производителност","производственост","пролет","променливост","променчивост","променяемост","промишленост","промокаемост","пронизителност","проникновеност","проницаемост","проницателност","пропаст","проповед","пропорционалност","пропускливост","просветеност","простоватост","просторност","простосърдечност","пространственост","противност","противозаконност","противоположност","противоправност","противоречивост","противотежест","проходимост","прочувственост","пръст - пръхкавост","прямолинейност","псевдонаучност","психопатологичност","публичност","пуерилност","пустош","пухкавост","пъзливост","пълноценност","пъпчивост","първичност","първобитност","първокачественост","първоразрядност","първостепенност","пъргавост","раболепност","работливост","работоспособност","равнозначност","равномерност","равностойност","равноценност","радиоактивност","радиовест","радост","радушност","раждаемост","разбираемост","разбраност","разбърканост","развеселеност","развитост","развратеност","развратност","развълнуваност","разгащеност","разглезеност","разговорливост","разгорещеност","разгулност","разгърнатост","раздалеченост","раздвоеност","разделност","раздразненост","раздразнимост","раздразнителност","раздробеност","разединеност","разкапаност","разкаяност","разкривеност","разкъсаност","различимост","разлятост","разменяемост","разнебитеност","разнеженост","разновидност","разноликост","разнообразност","разнородност","разностранност","разноцветност","разпаленост","разпасаност","разпереност","разпиляност","разплутост","разпокъсаност","разположеност","разпоредителност","разпространеност","разпростряност","разпръснатост","разпуснатост","разреденост","разрешимост","разрушителност","разръфаност","разсеяност","разслабеност","разстроеност","разсъблеченост","разсъдителност","разсъдливост","разсъдъчност","разтворимост","разтегаемост","разтегленост","разтегливост","разтегнатост","разтопимост","разточителност","разтревоженост","разтрогваемост","разумност","разхайтеност","разхвърляност","разхлабеност","разчувственост","разчувствуваност","разширимост","разширяемост","разюзданост","растителност","рафинираност","рационалност","реактивност","реакционност","реализуемост","реалистичност","реалност","ревнивост","ревност","редовност","редундантност","резервираност","резистентност","резливост","резултатност","релативност","релефност","религиозност","рентабилност","реторичност","ретроградност","рехавост","реципрочност","реч","речовитост","решимост","решителност","рискованост","ритмичност","ритуалност","родственост","романтичност","ронливост","рохкавост","рошавост","рунтавост","рушимост","ръбатост","рядкост","рязкост","самобитност","самовлюбеност","самодейност","саможертвеност","саможивост","самокритичност","самоличност","самомнителност","самонадеяност","самоотверженост","самопожертвувателност","самородност","самостоятелност","самотност","самоувереност","самоцел","сантименталност","саркастичност","сатиричност","сбитост","свадливост","свежест","свенливост","светкавичност","светлост","светлочувствителност","светост","свещ","свиваемост","свидливост","свирепост","свитост","своевременност","своенравност","своеобразност","свойственост","свръхнаселеност","свръхпроводимост","свръхчувствителност","свързаност","свяст","святост","сговорност","сговорчивост","сгодност","сгорещеност","сгъваемост","сгъстимост","сдържаност","себеобич","себеотрицателност","себепожертвувателност","себестойност","себичност","секретност","сексуалност","селективност","семейност","семейственост","сензационност","сенилност","сервилност","сериозност","сетивност","сеч","сигурност","симетричност","симулативност","синонимност","синхронност","сипкавост","системност","ситост","сияйност","скверност","скептичност","склонност","скованост","сконфузеност","скороподемност","скорост","скреж","скритост","скромност","скучност","скъпоценност","слабоватост","слабограмотност","слабост","слабохарактерност","сладникавост","сладост","сласт","слисаност","словесност","словоохотливост","сложност","сломимост","слуз","случайност","смахнатост","смелост","сменяемост","смес","смесимост","смет","смилаемост","смиреност","смисленост","смрадливост","смуглост","смутеност","смълчаност","смърт","смъртност","смъртоносност","смътност","снабденост","снажност","снизходителност","собственост","сол","соленост","солидарност","солидност","социалност","сочност","спареност","спестовност","специалност","специфичност","спешност","спираловидност","спиртност","сплав","сплеснатост","сплетеност","сплотеност","сплутост","споеност","сполучливост","спонтанност","спорност","способност","справедливост","спретнатост","сприхавост","сравнимост","срамежливост","срамливост","сродност","сръдливост","сръчност","стабилност","стадийност","стадност","старателност","старинност","старомодност","старост","статичност","стегнатост","степ","степен","стерилност","стесненост","стеснителност","стипчивост","стисливост","стиснатост","стихийност","стойност","стопяемост","странност","страст","страстност","страхливост","страховитост","стремглавост","стремителност","строгост","стройност","стръвност","студоустойчивост","субективност","суеверност","суетливост","суетност","суровост","сутрин","сухост","сферичност","схванатост","схватливост","схематичност","сходност","схоластичност","съблазнителност","събуденост","съвест","съвестност","съвкупност","съвместимост","съвременност","съгласуваност","съгласуемост","съдбовност","съдбоносност","съдимост","съдържателност","съдържимост","съзвучност","съзерцателност","съзнателност","съизмеримост","съкратеност","съкратимост","сълзливост","съмнителност","сънливост","съобразителност","съобразност","съответственост","съотносителност","съпричастност","съпротивляемост","съразмерност","сърдечност","сърдитост","сърцатост","съсобственост","съсредоточеност","състоятелност","състрадателност","съчлененост","същественост","същност","сюблимност","тайнственост","тактичност","талантливост","твар","твърдост","театралност","тежест","темпераментност","тенденциозност","теоретичност","термоустойчивост","течност","типичност","тираничност","тленност","товаровместимост","товароподемност","товароспособност","токсичност","толерантност","тоналност","топимост","топлоемкост","топлопроводимост","точност","трагичност","традиционност","трайност","тревожност","трезвеност","трезвост","трескавост","тривиалност","трогателност","тромавост","троснатост","трошливост","трудност","трудоемкост","трудолюбивост","трудоспособност","трънливост","тръпчивост","туткавост","тучност","тъждественост","тъкан","тънкост","тъпост","тържественост","търпеливост","търпимост","тягост","убеденост","убедителност","увереност","увлекателност","увредимост","угар","угледност","угнетеност","угодливост","угоеност","угриженост","удачност","удовлетвореност","удолетвореност","удълженост","уединеност","уклончивост","укрепналост","улегналост","улисаност","умелост","умереност","уместност","умисленост","умишленост","умозрителност","умоповреденост","уморителност","унесеност","универсалност","унизеност","уникалност","унилост","унищожимост","упадъчност","упоритост","употребимост","употребитеност","управляемост","уравновесеност","уредност","уродливост","усамотеност","уседналост","усетливост","условност","усложненост","услужливост","успеваемост","успешност","успоредност","установеност","устатост","устойчивост","устременост","устремност","усуканост","усърдност","уталоженост","утилитарност","утоленост","утолимост","утопичност","уточненост","утрин","участ","ученолюбивост","ученост","учтивост","уютност","уязвимост","фалшивост","фамилиарност","фанатичност","фантастичност","фаталност","фееричност","фигуративност","фиктивност","финност","флегматичност","формалност","фрагментарност","фреквентност","фригидност","функционалност","халтавост","хаотичност","хапливост","характерност","хармоничност","херметичност","хетерогенност","хигроскопичност","хилавост","химеричност","хиперболичност","хитрост","хищност","хлабавост","хладнокръвност","хладност","хлътналост","хомогенност","хоризонталност","храброст","хранителност","хрисимост","хрупкавост","хубост","художественост","хуманитарност","хуманност","цапнатост","царственост","цветност","цев","цел","целебност","целенасоченост","целесъобразност","целеустременост","целеустремителност","целокупност","целомъдреност","ценност","централност","цепителност","церемониалност","церемонност","церовитост","цикличност","циничност","цялост","цялостност","чаровност","част","частичност","частност","челюст","челяд","чепатост","чест","честност","честолюбивост","четвърт","четимост","четливост","численост","чистоплътност","чистосърдечност","членоразделност","човечност","чрезмерност","чуваемост","чувственост","чувствителност","чудатост","чудноватост","чудовищност","чупливост","шаблонност","шантавост","шареност","шеговитост","шеметност","шишкавост","шупливост","щателност","щедрост","щекотливост","ъгловатост","юначност","ядовитост","язвителност","якост","яловост","яркост","ярост","песен","мисъл","помисъл","предумисъл","промисъл","съблазън","зрялост","цялост","вярност","връв","кръв","скръб","стръв","вар","гръд","жар","жлъч","кал","плам","плът","пот","сган","шир"};
   private final String[] softExclusions = {"тоест","днес","огън","кон","ден","антиквар","аптекар","архивар","байрактар","баничар","бележкар","библиотекар","биволар","билкар","благодетел","благожелател","благотворител","блюстител","богослужител","болничар","ботушар","брадвар","бранител","броител","бронеизтребител","бръснар","бубар","будител","бунтар","бъчвар","ваятел","вдъхновител","веслар","вестител","вестникар","вехтошар","вещател","взаимопоръчител","взискател","винар","винопроизводител","владетел","властител","вложител","вносител","воденичар","водител","воловар","вратар","вредител","вретенар","вседържител","въглищар","въдичар","въжар","възбудител","възвестител","въздухоплавател","въздържател","възобновител","възпитател","възпроизводител","възродител","възстановител","възхвалител","гадател","гайдар","гешефтар","главатар","гласоподавател","глухар","говедар","говорител","годежар","голишар","гонител","господар","гостилничар","грабител","градинар","граматикар","граничар","гребенар","гробар","грънчар","гуслар","гъбар","гъдулар","гълъбар","гъсар","дарител","деловодител","десничар","деятел","добродетел","доброжелател","доверител","домопритежател","домостроител","домоуправител","домошар","другар","дървар","държател","електронагревател","емисар","еничар","естествоизпитател","жабар","жалбоподател","железар","железничар","женкар","жетвар","житар","жител","житопроизводител","жътвар","завещател","завоевател","заемодател","зайчар","заклинател","законодател","закононарушител","залесител","залогоприемател","заробител","заседател","застраховател","заявител","звенар","звероукротител","звънар","зеленчукопроизводител","земевладетел","земепритежател","зидар","златар","зложелател","злоупотребител","знахар","зрител","зъбар","зъболекар","избавител","избирател","известител","извършител","издател","изкупител","изкусител","изкушител","изложител","износител","изобличител","изобразител","изобретател","изпитател","изполичар","изпълнител","изразител","изследовател","изтезател","изявител","изяснител","иманяр","каменар","камилар","капиталовложител","картечар","картотекар","каруцар","катунар","кацар","кашавар","килимар","кинозрител","кинолюбител","клетвонарушител","клисар","клюкар","ключар","книговодител","книгоиздател","книжар","кожар","кожухар","козар","козинар","кокошар","кокошкар","колар","колбасар","коледар","колесар","колибар","количкар","комисар","комунар","коняр","копринар","корабоплавател","корабостроител","коритар","корсар","котлар","коцкар","кошничар","кравар","краставичар","критикар","крушар","кръводарител","кръчмар","кучкар","ласкател","левичар","лекар","ленопроизводител","лечител","леяр","лисичар","лихвар","лодкар","лозар","лопатар","лъжесвидетел","любител","магаретар","маджар","малинар","мамалигар","марколюбител","маслар","машиностроител","медар","медникар","мелничар","менител","месар","метлар","мечкар","мечтател","мислител","митничар","млекар","молбоподател","молител","мореплавател","мулетар","мъжкар","мъстител","мъчител","наблюдател","навестител","надзирател","надничар","наемател","наемодател","нападател","нарушител","насърчител","недоброжелател","неприятел","нестинар","носител","обаятел","обвинител","обединител","обитател","облекчител","обновител","ободрител","обожател","обущар","обявител","овощар","овчар","огняр","опашкар","описател","оповестител","опозорител","опустошител","оризар","осведомител","освободител","осигурител","осиновител","осквернител","оскърбител","основател","осъществител","откривател","отмъстител","отпускар","отровител","оценител","очилар","пазител","памукопроизводител","паркостроител","пашкулопроизводител","пекар","печалбар","печатар","пивовар","пилчар","писар","писател","планинар","плочар","победител","повелител","повествовател","погасител","подател","подбудител","подновител","подпредседател","подражател","подсекретар","подстрекател","подуправител","пожарникар","пожертвувател","покорител","покровител","покупател","покушител","получател","помирител","поощрител","попечител","порицател","поробител","поръчител","посегател","посетител","последовател","потребител","похитител","почитател","пояснител","правонарушител","праобитател","прапрародител","прародител","преброител","предател","предвестител","предвещател","предводител","предизвестител","предизвикател","предпазител","председател","предсказател","предсказвател","представител","предявител","прелъстител","пренаемател","преносител","преподавател","препоръчител","преустроител","придружител","приемател","примирител","приносител","природоизпитател","притежател","притеснител","причинител","приятел","проверител","производител","просветител","просител","профпредседател","профсекретар","птицегадател","птичар","пчелар","пъдар","първоучител","работодател","радетел","радиоговорител","радиолюбител","радиоприемател","радиослушател","разобличител","разорител","разпоредител","разпространител","разрушител","разточител","разузнавател","резбар","рекламодател","речникар","рибар","рицар","родител","розопроизводител","ругател","рудар","рудничар","рушител","ръкавичар","ръководител","самоучител","санитар","сапунар","сватбар","светител","свещар","свещенослужител","свидетел","свинар","сградостроител","сгъстител","седлар","секретар","семенар","сиренар","сладкар","следовател","словослагател","служител","слушател","сметководител","смутител","снабдител","соколар","солопроизводител","спасител","спестител","спомосъществувател","стачконарушител","стокопроизводител","столар","стражар","строител","стругар","стъклар","сурвакар","счетоводител","съблазнител","съвместител","съглашател","съдържател","съжител","създател","съзерцател","съизвършител","сънаемател","сънотълкувател","съосновател","съпритежател","съставител","състезател","съчинител","талигар","телезрител","телохранител","телчар","тепавичар","тиквар","товарител","токоизправител","торбар","точилар","тухлар","тъжител","тълкувател","тъмничар","тъпанар","тютюнопроизводител","уведомител","угнетител","удостоверител","укорител","укривател","укротител","умирител","умиротворител","управител","утешител","учебникар","учител","учредител","фотолюбител","хидростроител","хлебар","хлебопекар","хлопатар","хранител","хулител","хусар","цвеклопроизводител","цветар","целител","ценител","церител","цигулар","часовникар","чергар","черешар","четкар","чехлар","чизмар","читател","чушкар","шапкар","юбиляр","ябълкар","ягодар","яйчар","антиокислител","бацилоносител","ветропоказател","взривател","видеоускорител","високоговорител","водоизпускател","водопоказател","втвърдител","възпламенител","двигател","делител","дихател","дразнител","електродвигател","забавител","заглушител","закъснител","заличител","заместител","запалител","затъмнител","звукозаглушител","змиеукротител","знаменател","зърнопроизводител","изключвател","изпарител","изправител","изравнител","изтребител","изцелител","изчислител","искрогасител","крепител","кръвосмесител","маслопоказател","множител","нагревател","насекомоизтребител","нивопоказател","нравоучител","обезпрашител","обител","обтекател","обяснител","овлажнител","ограничител","озеленител","окислител","оплодотворител","определител","осветител","отделител","отражател","отразител","охладител","оцветител","пароразпределител","паросъбирател","подсладител","пожарогасител","показател","прахоуловител","превключвател","предавател","преобразовател","пречупвател","продължител","протривател","проявител","пълнител","пътеводител","пътепоказател","пътеуказател","радиопредавател","разделител","раздразнител","раздробител","разединител","разклонител","разпределител","разредител","разтворител","разширител","разяснител","смесител","смукател","събирател","съблюдател","съединител","съхранител","токоразпределител","удължител","указател","умалител","унищожител","уплътнител","уравнител","усилвател","ускорител","усмирител","утаител","числител","шумозаглушител","цар","лакът","нокът","път","кръстопът","сън","полусън","пет","шест","седем","осем","девет","десет","ят"};
   private final String[] usRoots = {"бъбр","бъд","въб","въг","въгл","въд","въжд","възе","възли","възлов","въжар","въже","въсен","въси","въся","въсва","вътр","глъб","гнъс","гълъб","гъб","гъд","гъж","гъз","гъс","гъш","гъж","гъст","дъб","дъг","жълъд","желъд","зъб","кръг","кръж","къд","къдр","кък","къп","къс","кът","къщ","лък","лъч","могъщ","мъдър","мъдр","мъж","мък","мъч","мът","прът","пръч","пъд","пъжд","пъкв","пъкн","пъч","пъч","пъп","път","ръб","ръг","ръд","ръж","рък","ръч","скъд","скъп","стъп","събот","съд","съжд","съчк","съств","същ","тръб","тъг","тъж","тъд","тъп","тътен","тътн","ъгъл", "ъглов","ъглест","ъглен"};
   private final String[] yatRoots = {"навеват","блес","креп","вещ","щех","блещ","прѣмен","трещ","прѣдмет","девич","девиц","девойк","стрел","беден","бедн","блед","обет","обеща","месеч","месец","север","подметка","зиковед","увед","свед","обмен","успеш","убежд","убед","стенен","стенн","сед","легн","рекъл","рекли","рекох","болест","зенит","дорде","гризел","умнел","търпел","грел","жалел","стег","меси","месва","клещ","певче","певци","певец","сеч","секл","впрег","бнел","къпел","живел","къснел","попел","дей","врел","резач","реже","песен","песн","смех","сенч","сеща","усет","сети","сетя","редки","главорез","звезд","немск","немец","немц","време","цена","цени","ценн","цене","цено","трев","побед","реч","помен","мнен","семе","где","вред","треб","опред","добре","греш","неко","некак","ее","ея","блен","блесък","брег","тез","онез","горе","после","сетне","подире","брез","брест","бег","бел","десен","десн","след","бес","вдевам","влез","влека","вменя","вместо","вмета","впрега","врева","врека","вреска","въпреки","век","вер","все","къде","вет","гнев","гнездо","голем","грех","додевам","дотега","дремя","дрен","дева","дедо","дело","дел","делник","десен","лезо","заверява","завехва","за̀вет","замена","заплесва","заповед","засеня","затега","звер","зепа","излез","изменя","веря","изповед","изтега","клека","колено","крека","крехък","лев","лега","лек","лесковец","лето","млеко","мрена","мер","место","меся","метна","мета","мехъ","наблега","надева","надена","налега","намеря","намеса","наместо","наместя","например","натега","вест","вменяем","деля","нега","немам","ненка","неща","нещо","облега","облека","обсега","обсенитя","обтега","обед","одева","орех","осветя","осеня","отребка","плевя","плева","плеска","поверя","повесмо","повехва","подевка","поколение","помета","делник","посега","лез","меня","мени","тега","пример","пролез","пролет","променя","проповед","протега","прекор","прек","пренос","препорец","пресен","преспа","преча","пена","песък","разменя","разтега","редък","режа","река","репа","свен","свест","свет","светя","светлина","свещ","сделка","денка","скробела","слез","слез","слеп","смес","смета","снег","сподел","спрега","спречка","спевка","сред","срещ","стреска","стреха","стега","съвместим","съвест","сека","сенка","сено","сера","Сер","требва","требка","тревна","треска","тело","тесен","тесн","тесто","тъдева","увехва","уместен","упреква","усетя","хлеб","хрен","цвет","целун","целув","цел","целина","целя","цер","церово","чове","тех","блян","бляс","бряг","бряз","бряст","бяг","бял","бяс","вдявам","вляз","вляка","вмяня","вмясто","вмята","впряга","врява","вряка","вряска","въпряки","вяк","вяно","вяр","вято","гняв","гняздо","голям","грях","додявам","досяга","дотяга","дрямя","дрян","дядо","дяло","дял","дялник","дясен","лязо","завярява","завяхва","за̀вят","заплясва","заповяд","засяга","засяня","затяга","звяр","зяпа","изляз","измяня","вяря","изповяд","изтяга","кляка","коляно","дясн","кряка","кряхък","ляви","ляво","горял","видях","видял","берях","ляга","ляк","лясковец","лято","мляко","мряна","мяна","мяр","място","мяся","мята","мяхъ","набляга","надяна","наляга","намяря","намяса","намясто","намястя","напримяр","натяга","вян","вяста","вмяняем","дяля","мянно","ряз","няга","нямам","ням","нянка","нящо","обляга","обляка","обсяга","обсянитя","обтяга","обяд","одява","орях","освятя","осяня","отрябка","плявя","плява","пляска","повяря","повясмо","повяхва","подявка","поколяние","помята","дялник","посяга","ляз","мяня","сяга","тяга","примяр","проляз","пролят","промяня","проповяд","протяга","прякор","пряк","прянос","пряпорец","прясен","пряспа","пряча","пяна","пясък","размяня","разтяга","рядък","ряжа","ряка","ряпа","свян","свяст","свят","святя","святлина","свящ","сдялка","дянка","скробяла","сляз","сляз","сляп","смяс","смята","сняг","сподял","пря","спряга","спрячка","спявка","сряд","сряща","стряска","стряха","стяга","съвмястим","съвяст","сяда","сяка","сянка","сяно","сяра","Сяр","трябва","трябка","трявна","трям","тряска","тяло","тясен","тясн","тясто","тъдява","увяхва","умястен","упряква","усятя","хляб","хрян","цвят","цялун","цялув","цял","цялина","цяля","цяр","цярово","тях","гряш","добря","всяко","рядк","засява","прѣсява","отсява","пява","наврял","пролял","грява","врял","попял","къснял","живял","смял","сякъл","сякл","жалял","грял","търпях","търпял","умнял","гризял","смях","щях","засмя","умря","навяват"};
   private final String[] exclusionWords = {"празник","празнич","сърц","сърчи","нужни","въстан","въстава","нишк","овошк"};
   private final String[] correctedExclusionWords = {"праздник","празднич","сърдц","сърдчи","нуждни","възстан","възстава","нищк","овощк"};
   private final String[] abbreviations = {"хм","напр","кг","лв","др","абв","т","н","пр","сащ","проф","гр","сл","ссср","хр","доц","бкп","сдс","дпс","мн","ч","р","ж","ср","св","стр","подкл","кл","чл","кр","мвр","бан","момн","мон","аец","заб","бул","ул","вм","вж","пл","церн","бзнс","бнб","онс","внс"};
   private final String[] yatExcl = {"сърцер","вермахт","келев","заклев","ръждяс","неяс","сеймен","кемер","вещта","вещитѣ","вещест","формени","светиня","уравновесено","череп","предмет","делег","теза","мебел","юдей","червея","лозенит","револвер","светци","светец","светия","тревож","тревог","знамен","разтопяв","меркур","облеч","облек","донесен","номер","паметн","свещен","нещаст","хипоте","седм","седем","полез","моисея","прежда","девер","дървета","светост","удрян","вселен","ветѣ","способлен","олек","неестествен","небес","начумер","технол","техниц","технич","техник","елек","загорец","саменичък","унесен","мерси","идейн","идеен","алинея","подобре","подобря","интелект","обедин","лека","леки","леко","прахоляк","пилето","тезгя","чудес","идея","оскъден","правете","полето","филоксера","сцен","колект","здравето","дебел","порядък","вериг","вериж","америка","алекс","деликат","десет","тъмнен","земята","лекц","модел","метал","обясн","правят","счупена","универ"};
   private final String[] usExcl = {"ръжд","стрък","набъбр","мрък","пламък","хаджилък","пъпл","подарък","брък","млък","тъжде","бръчк","гръд","мръд","хврък","съдърж","малък","вмък","гръб","възлиза","залък","дръж","камък","камъче","кръчм","момък","скръб","смък","съдейст","съдѣйст","тръг"};
   private final int usLen = usRoots.length;
   private final int yatLen = yatRoots.length;
   private final int exLen = exclusionWords.length;
   private String[] words;
   private String[] unchangedWords;
   private Locale loc = new Locale("bg", "BG");
   private final int YAT_BORDER = 300;

   private final String regex = "[ .*+:;?!~@#$^,`\'\"„“„”’&|()<>\\{\\}=‹›\\-—–−_«»‹›\\[\\]\r\t\n/\\+]";
   private String text;
   private ArrayList<String> oWords, words1, words2, excWords, exc1, exc2;

   private ProgressBar pb;

	public Converter(String text, ArrayList<ArrayList<String>> list1, ArrayList<ArrayList<String>> list2, ProgressBar pb){
		this.text = text;
		oWords = list1.get(0);
		words1 = list1.get(1);
		words2 = list1.get(2);
		excWords = list2.get(0);
		exc1 = list2.get(1);
		exc2 = list2.get(2);
		this.pb = pb;
		words = text.split(regex);
		unchangedWords = words.clone();
		checkWords();
	}

	public Converter(String text, ArrayList<ArrayList<String>> list1, ArrayList<ArrayList<String>> list2){
		this.text = text;
		oWords = list1.get(0);
		words1 = list1.get(1);
		words2 = list1.get(2);
		excWords = list2.get(0);
		exc1 = list2.get(1);
		exc2 = list2.get(2);
		words = text.split(regex);
		unchangedWords = words.clone();
		checkWords();
	}


	/**
     * Проверява дали има елемент val в масива arr
     */
    private boolean includes(String[] arr,String val){
        return Arrays.asList(arr).contains(val);
    }

    /**
     * Добавя краесловните ерове при думи завършващи на съгласна
     */
    private boolean checkEnding(int i, String currentWord, String lastChar, boolean isUpperCase){
        if(includes(cons,lastChar)){

            if(includes(abbreviations, currentWord)){
                return false;
            }
            if(includes(softEndingWords,currentWord) || includes(softExclusions,currentWord)){
                if(isUpperCase){
                    words[i] += "Ь";
                }else{
                    words[i] += "ь";
                }
                return true;
            }
            if((currentWord.length()>2) && (currentWord.substring(currentWord.length()-2).equals("ят") || currentWord.substring(currentWord.length()-2).equals("ът"))){
                if(includes(softExclusions,(currentWord.substring(0,currentWord.length()-2)))){
                    if(isUpperCase){
                        words[i] = words[i].substring(0,currentWord.length()-2) + "ЬТ";
                    }else{
                        words[i] = words[i].substring(0,currentWord.length()-2) + "ьт";
                    }
                }
            }
            if(currentWord.length()>1 || (currentWord.equals("с") || currentWord.equals("в")))
            if(isUpperCase){
                words[i] += "Ъ" ;
            }else{
                words[i] += "ъ" ;
            }

            return true;
        }
        return false;
    }

    /**
     * Поставя буква 'ѫ' на етимологическото ѝ място в думите
     */
    private boolean checkUs(int i, String currentWord, boolean isUpperCase){

    	if(currentWord.equals("са")){
             if(isUpperCase){
                 words[i] = words[i].replaceFirst("А","Ѫ");
             }else{
                 words[i] = words[i].replaceFirst("а","ѫ");
             }
              return true;
        }else if (currentWord.equals("кът") || currentWord.equals("път") || currentWord.equals("прът")){
        	if(isUpperCase){
                words[i] = words[i].replaceFirst("Ъ","Ѫ");
            }else{
                words[i] = words[i].replaceFirst("ъ","ѫ");
            }
            return true;
        }


    	for (int j=0; j<usExcl.length; j++){
    		if (currentWord.indexOf(usExcl[j]) != -1) return false;
    	}

        for (int k=0; k<usLen; k++){
            int usIndex = currentWord.indexOf(usRoots[k]);
            if(usIndex != -1){
            	if(usRoots[k].equals("гълъб") || usRoots[k].equals("жълъд")) usIndex=+2;
                String rp1 = "ъ";
                String rp2 = "ѫ";
                if((words[i].substring(usIndex).indexOf("Ъ") < words[i].substring(usIndex).indexOf("ъ") && (words[i].substring(usIndex).indexOf("Ъ") != -1)) || words[i].substring(usIndex).indexOf("ъ") == -1){
                    rp1 = "Ъ";
                    rp2 = "Ѫ";
                }
                if(currentWord.substring(usIndex+1).equals("ът") || currentWord.substring(usIndex+1).equals("ътъ") || currentWord.substring(usIndex+2).equals("ът") || currentWord.substring(usIndex+2).equals("ътъ")) return false;
                words[i] = words[i].substring(0,usIndex) + words[i].substring(usIndex).replaceFirst(rp1,rp2);

                return true;
            }
        }

        return false;
    }

    /**
     * Поставя буква 'ѣ' на етимологическото ѝ място в думите, а също и в думите,в които при изговаряне се чува като я и като е
     */
    private boolean checkYat(int i, String currentWord, boolean isUpperCase, boolean checkTe){

    	if(currentWord.equals("сте") || currentWord.equals("вещ") || currentWord.equals("лев")) return false;
    	if (currentWord.equals("ляв") || currentWord.equals("лява")|| currentWord.equals("лявата") || currentWord.equals("бях") || currentWord.equals("бяха") || currentWord.equals("бяхме")){
			if(isUpperCase){
		        words[i] = words[i].replaceFirst("Я","Ѣ");
		    }else{
		        words[i] = words[i].replaceFirst("я","ѣ");
		    }
		    return true;
    	}
    	if (currentWord.equals("вежда") || currentWord.equals("вежди")|| currentWord.equals("веждата") || currentWord.equals("веждите")){
			if(isUpperCase){
		        words[i] = words[i].replaceFirst("Е","Ѣ");
		    }else{
		        words[i] = words[i].replaceFirst("е","ѣ");
		    }
		    if(!currentWord.equals("веждите"))return true;
		    currentWord = currentWord.replaceFirst("е","ѣ");
    	}

        boolean returnValue = false;
        if(checkTe && (currentWord.length()>=2 && currentWord.endsWith("те"))){
            if(isUpperCase){
                words[i] = words[i].substring(0,currentWord.length()-1) + "Ѣ";
            }else{
                words[i] = words[i].substring(0,currentWord.length()-1) + "ѣ";
            }
            returnValue = true;
        }
        if(currentWord.length()>=3 && (currentWord.substring(0,3).equals("пре") || currentWord.substring(0,3).equals("две"))){
            if(isUpperCase){
                words[i] = words[i].replaceFirst("Е","Ѣ");
            }else{
                words[i] = words[i].replaceFirst("е","ѣ");
            }
            currentWord = currentWord.replaceFirst("е","ѣ");
            returnValue = true;
        }else if(currentWord.length()>=2 && currentWord.substring(0,2).equals("ня")){
            if(isUpperCase){
                words[i] = words[i].replaceFirst("Я","Ѣ");
            }else{
                words[i] = words[i].replaceFirst("я","ѣ");
            }
            currentWord = currentWord.replaceFirst("я","ѣ");
            returnValue = true;
        }
        if(currentWord.contains("бележ") || currentWord.contains("белез") || currentWord.contains("белег")|| currentWord.contains("белех")|| currentWord.contains("белел")){
        	if(isUpperCase){
                words[i] = words[i].replaceFirst("БЕЛЕ","БѢЛѢ");
            }else{
                words[i] = words[i].replaceFirst("беле","бѣлѣ");
            }
        	currentWord = currentWord.replaceFirst("беле","бѣлѣ");
            returnValue = true;
        }else if(currentWord.contains("беляз")|| currentWord.contains("белял")|| currentWord.contains("белях")){
        	if(isUpperCase){
                words[i] = words[i].replaceFirst("БЕЛЯ","БѢЛѢ");
            }else{
                words[i] = words[i].replaceFirst("беля","бѣлѣ");
            }
        	currentWord = currentWord.replaceFirst("беля","бѣлѣ");
            returnValue = true;
        }else if(currentWord.contains("предмет")){
        	if(isUpperCase){
                words[i] = words[i].replaceFirst("ПРЕДМЕТ","ПРѢДМѢТ");
            }else{
                words[i] = words[i].replaceFirst("предмет","прѣдмѣт");
            }
        	currentWord = currentWord.replaceFirst("предмет","прѣдмѣт");
            returnValue = true;
        }
        for (int j=0; j<yatExcl.length; j++){
    		if (currentWord.indexOf(yatExcl[j]) != -1) return false;
    	}
        for (int k=0; k<yatLen; k++){
            int yatIndex = currentWord.indexOf(yatRoots[k]);
            if(yatIndex != -1){
                if(isUpperCase){
                    if(k<YAT_BORDER){
                        words[i] = words[i].substring(0,yatIndex) + words[i].substring(yatIndex).replaceFirst("Е","Ѣ");
                    }else{
                        words[i] = words[i].substring(0,yatIndex) + words[i].substring(yatIndex).replaceFirst("Я","Ѣ");
                    }

                }else{
                    if(k<YAT_BORDER){
                        words[i] = words[i].substring(0,yatIndex) + words[i].substring(yatIndex).replaceFirst("е","ѣ");
                    }else{
                        words[i] = words[i].substring(0,yatIndex) + words[i].substring(yatIndex).replaceFirst("я","ѣ");
                    }

                }
                return true;
            }
        }
        if(currentWord.equals("де") || currentWord.equals("бе") ){

            if(isUpperCase){
                words[i] = words[i].charAt(0) + "Ѣ";
            }else{
                words[i] = words[i].charAt(0) + "ѣ";
            }

            returnValue = true;
        }
        return returnValue;
    }

    /**
     * Променя "във" и "със" на "въ" и "съ"
     */
    private boolean checkVS(int i, String currentWord, boolean isUpperCase){
        if(currentWord.equals("във") || currentWord.equals("със")){
            if(isUpperCase){
                words[i] = words[i].charAt(0) + "Ъ";
            }else{
                words[i] = words[i].charAt(0) + "ъ";
            }
            return true;
        }
        return false;
    }

    /**
     * Добавя буква "ь" при членуването на съществителни от женски род където има двойно "т" или "щт"
     */
    private boolean checkFemaleThe(int i, String currentWord, boolean isUpperCase){
        if(currentWord.length()>=3 && (currentWord.endsWith("тта") || currentWord.endsWith("щта")) ){
            if(isUpperCase){
                words[i] = words[i].substring(0,currentWord.length()-2) + "Ь" + words[i].substring(currentWord.length()-2);
            }else{
                words[i] = words[i].substring(0,currentWord.length()-2) + "ь" + words[i].substring(currentWord.length()-2);
            }
            return true;
        }else if(currentWord.length()>=3 && currentWord.substring(currentWord.length()-2).equals("та")){
        	if(includes(softEndingWords,(currentWord.substring(0,currentWord.length()-2)))){
                if(isUpperCase){
                    words[i] = words[i].substring(0,currentWord.length()-2) + "ЬТА";
                }else{
                    words[i] = words[i].substring(0,currentWord.length()-2) + "ьта";
                }
                return true;
        	}
        }
        return false;
    }

    /**
     * Проверява дали думата съдържа корен, който е имал различно изписване
     */
    private boolean checkExclusionWords(int i, String currentWord, boolean isUpperCase){
        for (int k=0; k<exLen; k++){
            int exIndex = currentWord.indexOf(exclusionWords[k]);
            if(exIndex != -1){
            	String excl = exclusionWords[k].substring(1);
            	String corr = correctedExclusionWords[k].substring(1);
                if(isUpperCase){
                    words[i] = words[i].replaceFirst(excl.toUpperCase(loc),corr.toUpperCase(loc));
                }else{
                    words[i] = words[i].replaceFirst(excl,corr);
                }
                return true;
            }
        }
        return false;
    }

    /**
     * Използва външния списък с изключения и сравнява с тези в текста
     * @param i - индекса на думата, която се проверява
     * @return ако true, да не се извършват повече проверки и изменения на думата
     */
    private boolean firstConvert(int i, boolean isUpperCase){
    	int wIndex;
    	String tempWord = words[i];
    	String firstChar = String.valueOf(tempWord.charAt(0));
    	tempWord = tempWord.toLowerCase(loc);

    	wIndex = exc1.indexOf(tempWord);
		if(wIndex == -1){
			wIndex = exc2.indexOf(tempWord);
		}
		if(wIndex!=-1){
			words[i] = excWords.get(wIndex);
			if(isUpperCase) words[i] = words[i].toUpperCase();
			words[i] = firstChar + words[i].substring(1);
			return true;
		}
		return false;
    }

    /**
     * Използва външния списък с думи и сравнява с тези в текста
     * @param i - индекса на думата, която се проверява
     * @return ако false, не проверява дали думата завършва на наставка -те
     */
    private boolean secondaryConvert(int i, boolean isUpperCase){
    	int wIndex;
    	String tempWord = words[i];
    	String firstChar = String.valueOf(tempWord.charAt(0));
    	tempWord = tempWord.toLowerCase(loc);

    	wIndex = words1.indexOf(words[i]);
		if(wIndex == -1){
			wIndex = words2.indexOf(words[i]);
		}
		if(wIndex!=-1){
			words[i] = oWords.get(wIndex);
			if(isUpperCase) words[i] = words[i].toUpperCase();
			words[i] = firstChar + words[i].substring(1);
			if(words[i].endsWith("те")) return false;
		}
		return true;
    }

    /**
     * Конвертира масива от думи words и заменя съответните думи в текста
     */
    private void checkWords(){
    	int size = words.length;
    	int index = 0;
        for (int i=0; i<size; i++){


			//Проверява всяка дума и извършва нужните промени
	        try {

            if(words[i].length()>0){

                String lastChar = String.valueOf(words[i].charAt(words[i].length() - 1));
                boolean isUpperCase = ((!lastChar.equals(lastChar.toLowerCase(loc))) && words[i].length() > 1);
                lastChar = lastChar.toLowerCase(loc);

                boolean checkTe = true;
            	boolean noFurtherChecks = firstConvert(i, isUpperCase);
            	if(!noFurtherChecks){
            		checkTe = secondaryConvert(i, isUpperCase);
            	}

            	lastChar = String.valueOf(words[i].charAt(words[i].length() - 1));
                lastChar = lastChar.toLowerCase(loc);
                String currentWord = words[i].toLowerCase(loc);
                String temp =  unchangedWords[i];

        		index += text.substring(index).indexOf(temp);
        		if(!noFurtherChecks){
	        		checkEnding(i,currentWord, lastChar, isUpperCase);
	        		checkUs(i, currentWord, isUpperCase);
	        		checkYat(i, currentWord, isUpperCase, checkTe);
	        		checkVS(i, currentWord, isUpperCase);
	               	checkFemaleThe(i, currentWord, isUpperCase);
	               	checkExclusionWords(i, currentWord, isUpperCase);
            	}
               	//Заменя всяка дума в текста със съответстващата конвертирана дума
               	if(index ==0){
               		while(index + temp.length() < text.length() && !regex.contains(String.valueOf(text.charAt(index+temp.length())))){
               			index += temp.length();
        				index += text.substring(index).indexOf(temp);
        			}
               	}else{
               		while(index + temp.length() < text.length() && !(regex.contains(String.valueOf(text.charAt(index+temp.length()))) && regex.contains(String.valueOf(text.charAt(index-1))) )){
               			index += temp.length();
               			index += text.substring(index).indexOf(temp);
        			}
               	}
               	//System.out.println(i + " дума: " + words[i] + " след: " + text.charAt(index+temp.length()) + " преди: " + text.charAt(index-1));
               	text = text.substring(0, index) + text.substring(index).replaceFirst(temp, words[i]);
               	index += words[i].length();

            }

            }catch (Exception e){
            	System.err.println("Failed at: " + words[i] );
            	e.printStackTrace();
            }

            if(pb!=null) pb.setProgress((double)i/(double)size);
        }
    }

	public String getText(){
		return text;
	}
}
